#include "../cmd_holder.hpp"

void cmd_holder::help_cmd() {
  string help_info =
    "Список команд:\n"
    "⚠+crc32 {...} - сгенерить CRC-32 хеш-сумму строки\n"
    "⚠+sha256 {...} - сгенерить SHA-256 хеш-сумму строки\n"
    "⚠+пикча, +фото {...} - найти картинку среди просторов ВК\n"
    "⚠+видео, +видос {...} - поиск видеозаписей\n"
    "⚠+документ, +доки {...} - поиск документов\n"
    "⚠+погода {...} - показать погоду\n"
    "⚠+никнейм {...} - установить никнейм\n"
    "⚠+никнейм удалить - удалить никнейм\n";
  _message_send(help_info, NOT_USE_NICKNAME);
}
